TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_hsadc.h
/*
 * Copyright (c) 2025, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_hsadc.h
 *  @brief      High Speed Analog to Digital Converter (HSADC)
 *  @defgroup   HSADC Analog to Digital Converter (HSADC)
 *
 *  @anchor ti_dl_dl_hsadc12_Overview
 *  # Overview
 *
 *  The Analog to Digital Converter Driver Library allows full configuration of
 *  the MSPM33 ADC module.
 *  The ADC is a high-performance successive-approximation-register (SAR)
 *  analog-to-digital converter.
 *
 *  <hr>
 ******************************************************************************/
/** @addtogroup HSADC
* @{
*/
#ifndef ti_dl_dl_hsadc__include
#define ti_dl_dl_hsadc__include

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#include <stdbool.h>
#include <stdint.h>

#ifdef __MSP_HAS_HSADC__

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @brief Interrupt pulse position.
 *  set interrupt pulse position to 0 for pulse generation to occur when ADC begins conversation + a number of sysclk cycles controlled by DL_HSADC_setEarlyInterruptGenerationDelay
 * set interrupt pulse position to 1 for pulse dgeneration to occur at the end of conversion 1 cycle prior to the ADC result latching into its result register
 */
typedef enum{
    DL_HSADC_InterruptPulsePosition_beginning_of_conversation = 0,
    DL_HSADC_InterruptPulsePosition_end_of_conversation = 1
}DL_HSADC_InterruptPulsePosition;
 

/**
 * @brief ADC clock divider. 
 * ADCCLK = (input clock) / divider
 * available divider = 1.0, 2.0, 2.5, 3.0, 3.5, 4.0, 4.5, 5.0, 5.5, 6.0, 6.5, 7.0, 7.5, 8.0, 8.5
 */
typedef enum
{
    DL_HSADC_CLOCK_DIVIDE_1_0 = 0U,                //!< ADCCLK = (input clock) / 1.0
    DL_HSADC_CLOCK_DIVIDE_2_0 = 2U,                //!< ADCCLK = (input clock) / 2.0
    DL_HSADC_CLOCK_DIVIDE_2_5 = 3U,                //!< ADCCLK = (input clock) / 2.5
    DL_HSADC_CLOCK_DIVIDE_3_0 = 4U,                //!< ADCCLK = (input clock) / 3.0
    DL_HSADC_CLOCK_DIVIDE_3_5 = 5U,                //!< ADCCLK = (input clock) / 3.5
    DL_HSADC_CLOCK_DIVIDE_4_0 = 6U,                //!< ADCCLK = (input clock) / 4.0
    DL_HSADC_CLOCK_DIVIDE_4_5 = 7U,                //!< ADCCLK = (input clock) / 4.5
    DL_HSADC_CLOCK_DIVIDE_5_0 = 8U,                //!< ADCCLK = (input clock) / 5.0
    DL_HSADC_CLOCK_DIVIDE_5_5 = 9U,                //!< ADCCLK = (input clock) / 5.5
    DL_HSADC_CLOCK_DIVIDE_6_0 = 10U,               //!< ADCCLK = (input clock) / 6.0
    DL_HSADC_CLOCK_DIVIDE_6_5 = 11U,               //!< ADCCLK = (input clock) / 6.5
    DL_HSADC_CLOCK_DIVIDE_7_0 = 12U,               //!< ADCCLK = (input clock) / 7.0
    DL_HSADC_CLOCK_DIVIDE_7_5 = 13U,               //!< ADCCLK = (input clock) / 7.5
    DL_HSADC_CLOCK_DIVIDE_8_0 = 14U,               //!< ADCCLK = (input clock) / 8.0
    DL_HSADC_CLOCK_DIVIDE_8_5 = 15U                //!< ADCCLK = (input clock) / 8.5
} DL_HSADC_CLOCK_DIVIDE;

/**
 * @brief Interrupt number.
 * Interrupt 1, Interrupt 2, Interrupt 3, Interrupt 4
 */
typedef enum
{
    DL_HSADC_INT_1   = 0U,                      //Interrupt 1 
    DL_HSADC_INT_2   = 1U,                      //Interrupt 2
    DL_HSADC_INT_3   = 2U,                      //Interrupt 3
    DL_HSADC_INT_4   = 3U                       //Interrupt 4
}DL_HSADC_InterruptNumber;

/**
 * @brief SOC/EOC number.
 */
typedef enum
{
    DL_HSADC_SOC_NUMBER0 = 0U,        //!< SOC/EOC number 0
    DL_HSADC_SOC_NUMBER1 = 1U,        //!< SOC/EOC number 1
    DL_HSADC_SOC_NUMBER2 = 2U,        //!< SOC/EOC number 2
    DL_HSADC_SOC_NUMBER3 = 3U,        //!< SOC/EOC number 3
    DL_HSADC_SOC_NUMBER4 = 4U,        //!< SOC/EOC number 4
    DL_HSADC_SOC_NUMBER5 = 5U,        //!< SOC/EOC number 5
    DL_HSADC_SOC_NUMBER6 = 6U,        //!< SOC/EOC number 6
    DL_HSADC_SOC_NUMBER7 = 7U,        //!< SOC/EOC number 7
    DL_HSADC_SOC_NUMBER8 = 8U,        //!< SOC/EOC number 8
    DL_HSADC_SOC_NUMBER9 = 9U,        //!< SOC/EOC number 9
    DL_HSADC_SOC_NUMBER10 = 10U,      //!< SOC/EOC number 10
    DL_HSADC_SOC_NUMBER11 = 11U,      //!< SOC/EOC number 11
    DL_HSADC_SOC_NUMBER12 = 12U,      //!< SOC/EOC number 12
    DL_HSADC_SOC_NUMBER13 = 13U,      //!< SOC/EOC number 13
    DL_HSADC_SOC_NUMBER14 = 14U,      //!< SOC/EOC number 14
    DL_HSADC_SOC_NUMBER15 = 15U       //!< SOC/EOC number 15
} DL_HSADC_SOCNumber;

/**
 * @brief DMA Interrupt number.
 */
typedef enum
{
    DL_HSADC_DMA_INT_1   = 0U,                      //DMA Interrupt 1 
    DL_HSADC_DMA_INT_2   = 1U,                      //DMA Interrupt 2
    DL_HSADC_DMA_INT_3   = 2U,                      //DMA Interrupt 3
    DL_HSADC_DMA_INT_4   = 3U                       //DMA Interrupt 4
}DL_HSADC_DMA_InterruptNumber;

/**
 * @brief ADC input number
 */
typedef enum{
    DL_HSADC_IN_0 = 0U,
    DL_HSADC_IN_1 = 1U,
    DL_HSADC_IN_2 = 2U,
    DL_HSADC_IN_3 = 3U,
    DL_HSADC_IN_4 = 4U,
    DL_HSADC_IN_5 = 5U,
    DL_HSADC_IN_6 = 6U,
    DL_HSADC_IN_7 = 7U,
    DL_HSADC_IN_8 = 8U,
    DL_HSADC_IN_9 = 9U,
    DL_HSADC_IN_10 = 10U,
    DL_HSADC_IN_11 = 11U,
    DL_HSADC_IN_12 = 12U,
    DL_HSADC_IN_13 = 13U,
    DL_HSADC_IN_14 = 14U,
    DL_HSADC_IN_15 = 15U,
    DL_HSADC_IN_16 = 16U,
    DL_HSADC_IN_17 = 17U,
    DL_HSADC_IN_18 = 18U,
    DL_HSADC_IN_19 = 19U,
    DL_HSADC_IN_20 = 20U,
    DL_HSADC_IN_21 = 21U,
    DL_HSADC_IN_22 = 22U,
    DL_HSADC_IN_23 = 23U,
    DL_HSADC_IN_24 = 24U,
    DL_HSADC_IN_25 = 25U,
    DL_HSADC_IN_26 = 26U,
    DL_HSADC_IN_27 = 27U,
    DL_HSADC_IN_28 = 28U,
    DL_HSADC_IN_29 = 29U,
    DL_HSADC_IN_30 = 30U,
    DL_HSADC_IN_31 = 31U
} DL_HSADC_ADCIN;

/**
 * @brief SEQ/PPB/EVT number
 */
typedef enum
{
    DL_HSADC_SEQ_NUMBER1 = 0U,        //!< SEQ/PPB/EVT number 1
    DL_HSADC_SEQ_NUMBER2 = 1U,        //!< SEQ/PPB/EVT number 2
    DL_HSADC_SEQ_NUMBER3 = 2U,        //!< SEQ/PPB/EVT number 3
    DL_HSADC_SEQ_NUMBER4 = 3U         //!< SEQ/PPB/EVT number 4
} DL_HSADC_SEQNumber;

/**
 * @brief Offset trim value
 */
#define OFFSET_TRIM_VALUE(offset) ((offset) >= 0 ? (offset) * 16 : 256 - (-(offset)) * 16) 

/**
 * @brief Offset trim
 * Offset can be corrected in the range of +7 to -8 LSBs
 */
typedef enum {
    DL_HSADC_OffsetTrim_Minus_8LSB = OFFSET_TRIM_VALUE(-8),
    DL_HSADC_OffsetTrim_Minus_7LSB = OFFSET_TRIM_VALUE(-7),
    DL_HSADC_OffsetTrim_Minus_6LSB = OFFSET_TRIM_VALUE(-6),
    DL_HSADC_OffsetTrim_Minus_5LSB = OFFSET_TRIM_VALUE(-5),
    DL_HSADC_OffsetTrim_Minus_4LSB = OFFSET_TRIM_VALUE(-4),
    DL_HSADC_OffsetTrim_Minus_3LSB = OFFSET_TRIM_VALUE(-3),
    DL_HSADC_OffsetTrim_Minus_2LSB = OFFSET_TRIM_VALUE(-2),
    DL_HSADC_OffsetTrim_Minus_1LSB = OFFSET_TRIM_VALUE(-1),
    DL_HSADC_OffsetTrim_0LSB = OFFSET_TRIM_VALUE(0),
    DL_HSADC_OffsetTrim_1LSB = OFFSET_TRIM_VALUE(1),
    DL_HSADC_OffsetTrim_2LSB = OFFSET_TRIM_VALUE(2),
    DL_HSADC_OffsetTrim_3LSB = OFFSET_TRIM_VALUE(3),
    DL_HSADC_OffsetTrim_4LSB = OFFSET_TRIM_VALUE(4),
    DL_HSADC_OffsetTrim_5LSB = OFFSET_TRIM_VALUE(5),
    DL_HSADC_OffsetTrim_6LSB = OFFSET_TRIM_VALUE(6),
    DL_HSADC_OffsetTrim_7LSB = OFFSET_TRIM_VALUE(7),
} DL_HSADC_OffsetTrim;

/**
 * @brief Oversampling limit 
 */
typedef enum{
    DL_HSADC_OversamplingLimit_Nil = 0U,
    DL_HSADC_OversamplingLimit_2 = 1U,
    DL_HSADC_OversamplingLimit_4 = 2U,
    DL_HSADC_OversamplingLimit_8 = 3U
} DL_HSADC_OversamplingLimit;

/**
 * @brief PPB right shift
 */
typedef enum{
    DL_HSADC_PPBRightShift_0 = 0U,
    DL_HSADC_PPBRightShift_1 = 1U,
    DL_HSADC_PPBRightShift_2 = 2U,
    DL_HSADC_PPBRightShift_3 = 3U,
    DL_HSADC_PPBRightShift_4 = 4U,
    DL_HSADC_PPBRightShift_5 = 5U,
    DL_HSADC_PPBRightShift_6 = 6U,
    DL_HSADC_PPBRightShift_7 = 7U,
} DL_HSADC_PPBRightShift;

/**
 * @brief Sequence preempt
 */
typedef enum{
    DL_HSADC_seqPreempt_disable = 0, 
    DL_HSADC_seqPreempt_enable_noRestart = 2,
    DL_HSADC_seqPreempt_enable_restart = 3
} DL_HSADC_seqPreempt;

/**
 * @brief Trigger
 * used to select which trigger is used to initiate a conversion to start once priority is given to it.
 */
typedef enum{
    DL_HSADC_Trigger_TieLow_SW_Trig = 0,
    DL_HSADC_Trigger_GEN_SUB_0 = 1,
    DL_HSADC_Trigger_GEN_SUB_1 = 2,
    DL_HSADC_Trigger_GEN_SUB_2 = 3,
    DL_HSADC_Trigger_GEN_SUB_3 = 4,
    // DL_HSADC_Trigger_TIMA0_0_PUB2 = 5,
    // DL_HSADC_Trigger_TIMA0_1_PUB2 = 6,
    DL_HSADC_Trigger_TieLow = 7,
} DL_HSADC_Trigger;

/**
 * @brief sample cap reset select
 * used to select sample cap reset to either vrefhi/2 or vreflo
 */
typedef enum{
    DL_HSADC_sampleCapResetSelect_vreflo = 0,
    DL_HSADC_sampleCapResetSelect_half_vrefhi = 1
} DL_HSADC_sampleCapResetSelect;

/**
 * @brief publisher index
 */
typedef enum {
    DL_HSADC_PUBLISHER_INDEX_0 = 0,
    DL_HSADC_PUBLISHER_INDEX_1 = 1,
    DL_HSADC_PUBLISHER_INDEX_2 = 2,
    DL_HSADC_PUBLISHER_INDEX_3 = 3,
} DL_HSADC_PUBLISHER_INDEX;

/**
 * @brief subscriber index
 */
typedef enum {
    DL_HSADC_SUBSCRIBER_INDEX_0 = 0,
    DL_HSADC_SUBSCRIBER_INDEX_1 = 1,
    DL_HSADC_SUBSCRIBER_INDEX_2 = 2,
    DL_HSADC_SUBSCRIBER_INDEX_3 = 3,
} DL_HSADC_SUBSCRIBER_INDEX;

/**
 * @brief Step size between SOC CTL registers
 */
#define ADCSOCxCTL_M33_STEP 4U

/**
 * @brief Step size between ADCPPB CONFIG registers
 */
#define ADCPPBxCONFIG_M33_STEP 32U

/**
 * @brief Step size between ADCPPB LIMIT registers
 */
#define ADCPPBxLIMIT_LITE_STEP 64U

/**
 * @brief Step size between ADCPPB COUNT registers
 */
#define ADCPPBxPCOUNT_LITE_STEP 64U

/**
 * @brief Step size between ADCPPB RESULT registers
 */
#define ADCPPBxCONFIG2_M33_STEP 64U

/**
 * @brief Step size between ADCSEQ CONFIG registers
 */
#define ADCSEQxCONFIG_STEP 4U

/**
 * @brief Step size between ADCSEQ RESULT registers
 */
#define ADCRESULTx_12B_M33_STEP 2U

/**
 * @brief Step size between ADCSEQ STATUS registers
 */
#define ADCPPBxRESULT_12B_STEP 4U

/**
 * @brief Step size between ADCSEQ FIFO registers=
 */
#define ADCPPBxSUM_LITE_STEP 8U

/**
 * @brief Step size between ADCPPB COUNT registers
 */
#define ADCPPBxCOUNT_LITE_STEP 8U

/**
 * @brief Step size between ADCSEQ FIFO Result registers
 */
#define ADCSEQxFIFORESULT_STEP 4U

/**
 * @brief Step size between ADCSEQ FIFO Status registers
 */
#define ADCSEQxFIFOSTATUS_STEP 4U

/**
 * @brief maximum value of sample window
 */
#define maxSampleWindow 1472

/**
 * @brief minimum value of sample window 
 */
#define minSampleWindow 1

/**
 * @brief maximum value of delay for early interrupt generation
 */
#define maxDelayNumCycles 63

/**
 * @brief Asserts expression
 */
#define ASSERT(expr) do { if (!(expr)) { while (1); } } while (0)

/**
 * @brief Enables power in gprcm for hsadc module
 * 
 * @param adc is the base address of the ADC module.
 */
__STATIC_INLINE void DL_HSADC_enablePower(hsadc_ADC_LITE_REGS_Regs *adc)
{
    adc->GPRCM.PWREN |= ((HSADC_PWREN_ENABLE_ENABLE | HSADC_PWREN_KEY_UNLOCK_W) & (HSADC_PWREN_ENABLE_MASK | HSADC_PWREN_KEY_MASK));
}

/**
 * @brief Disables power in gprcm for hsadc module
 * 
 * @param adc is the base address of the ADC module.
 */
__STATIC_INLINE void DL_HSADC_disablePower(hsadc_ADC_LITE_REGS_Regs *adc)
{
    adc->GPRCM.PWREN = (adc->GPRCM.PWREN & ~(HSADC_PWREN_ENABLE_MASK | HSADC_PWREN_KEY_MASK)) | HSADC_PWREN_ENABLE_DISABLE | HSADC_PWREN_KEY_UNLOCK_W;
}

/**
 * @brief Returns if power is enabled or not
 * 
 * @param adc is the base address of the ADC module.
 * @return true: if power is enabled, false: if power is disabled 
 */
__STATIC_INLINE bool DL_HSADC_isPowerEnabled(hsadc_ADC_LITE_REGS_Regs *adc)
{
    return((adc->GPRCM.PWREN & HSADC_PWREN_ENABLE_MASK) == HSADC_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Asserts reset to the hasdc peripheral
 * 
 * @param adc is the base address of the ADC module.
 */
__STATIC_INLINE void DL_HSADC_reset(hsadc_ADC_LITE_REGS_Regs *adc)
{
    adc->GPRCM.RSTCTL = (HSADC_RSTCTL_RESETASSERT_ASSERT | HSADC_RSTCTL_RESETSTKYCLR_CLR | HSADC_RSTCTL_KEY_UNLOCK_W);
}

/**
 * @brief Returns if hsadc peripheral was reset
 * 
 * @param adc is the base address of the ADC module.
 * @return true: if peripheral was reset, false: if peripheral was not reset 
 */
__STATIC_INLINE bool DL_HSADC_isReset(hsadc_ADC_LITE_REGS_Regs *adc)
{
    return ((adc->GPRCM.STAT & HSADC_STAT_RESETSTKYCLR_MASK) == HSADC_STAT_RESETSTKYCLR_RESET);
}

/**
 *  @brief Sets the event publisher channel id
 *
 *  @param  adc is the base address of the ADC module.
 *  @param  index   Specifies the register event index to be configured
 *  @param  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      publisher is disconnected.
 */
__STATIC_INLINE void DL_HSADC_setPublisherChanID(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_PUBLISHER_INDEX index, uint8_t chanID)
{
    volatile uint32_t *pReg = &adc->FPUB_1;

