TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_hsadc.h
    *(pReg + (uint32_t) index) = (chanID & HSADC_FPUB_1_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event publisher channel id
 *
 *  @param  adc is the base address of the ADC module.
 *  @param  index   Specifies the register event index to be configured
 *
 *  @return     Event publisher channel ID
 */
__STATIC_INLINE uint8_t DL_HSADC_getPublisherChanID(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_PUBLISHER_INDEX index)
{
    volatile uint32_t *pReg = &adc->FPUB_1;

    return ((uint8_t)(*(pReg + (uint32_t) index) & HSADC_FPUB_1_CHANID_MASK));
}

/**
 * @brief Sets the event subscriber channel id
 * 
 * @param adc is the base address of the ADC module.
 * @param chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      subscriber is disconnected.
 */
__STATIC_INLINE void DL_HSADC_setSubscriberChanID(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SUBSCRIBER_INDEX index, uint8_t chanID)
{
    volatile uint32_t *pReg = &adc->FSUB_0;

    *(pReg + (uint32_t) index) = (chanID & HSADC_FSUB_0_CHANID_MAXIMUM);
}

/**
 * @brief Gets the event subscriber channel id
 * 
 * @param adc is the base address of the ADC module.
 * @return Event subscriber channel ID
 */
__STATIC_INLINE uint8_t DL_HSADC_getSubscriberChanID(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SUBSCRIBER_INDEX index)
{
    volatile uint32_t *pReg = &adc->FSUB_0;

    return ((uint8_t)(*(pReg + (uint32_t) index) & HSADC_FSUB_0_CHANID_MASK));
}

/**
 * @brief Returns if ADC is busy and cannot sample another channel
 * 
 * @param adc is the base address of the ADC module.
 * @return true: if ADC is busy, false: if ADC is available to sample next channel
 */
__STATIC_INLINE bool DL_HSADC_isBusy(hsadc_ADC_LITE_REGS_Regs *adc)
{
    return ((adc->ADC_LITE_REGS.ADCCTL1_LITE_ & HSADC_ADCCTL1_LITE__ADCBSY_MASK) == HSADC_ADCCTL1_LITE__ADCBSY_MASK);
}

/**
 * @brief returns SOC number of last converted SOC when SOC is free, returns SOC number of current SOC being converted when SOC is busy
 * 
 * @param adc is the base address of the ADC module.
 * @return SOC number of the last busy or current channel (4 bit value)
 */
__STATIC_INLINE uint32_t DL_HSADC_lastBusyChannel(hsadc_ADC_LITE_REGS_Regs *adc)
{
    return (((adc->ADC_LITE_REGS.ADCCTL1_LITE_) & (HSADC_ADCCTL1_LITE__ADCBSYCHN_MASK)) >> HSADC_ADCCTL1_LITE__ADCBSYCHN_OFS);
}

/**
 * @brief turns on power of all the analog circuitry inside the analog core
 * 
 * @param adc is the base address of the ADC module.
 */
__STATIC_INLINE void DL_HSADC_PowerUp(hsadc_ADC_LITE_REGS_Regs *adc)
{
    adc->ADC_LITE_REGS.ADCCTL1_LITE_ |= HSADC_ADCCTL1_1_ADCPWDNZ_MASK;
}

/**
 * @brief turns off power of all the analog circuitry inside the analog core
 * 
 * @param adc is the base address of the ADC module.
 */
__STATIC_INLINE void DL_HSADC_PowerDown(hsadc_ADC_LITE_REGS_Regs *adc)
{
    adc->ADC_LITE_REGS.ADCCTL1_LITE_ &= ~(HSADC_ADCCTL1_1_ADCPWDNZ_MASK);
}
/**
 * @brief set interrupt pulse position
 *  set interrupt pulse position to 0 for pulse generation to occur when ADC begins conversation + a number of sysclk cycles controlled by DL_HSADC_setEarlyInterruptGenerationDelay
 * set interrupt pulse position to 1 for pulse dgeneration to occur at the end of conversion 1 cycle prior to the ADC result latching into its result register
 * 
 * @param adc is the base address of the ADC module.
 * @param pulsePosition is the pulse position you want to set, can be 0 or 1
 */
__STATIC_INLINE void DL_HSADC_SetInterruptPulsePosition(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptPulsePosition pulsePosition)
{
    adc->ADC_LITE_REGS.ADCCTL1_LITE_ = (adc->ADC_LITE_REGS.ADCCTL1_LITE_ & ~(HSADC_ADCCTL1_LITE__INTPULSEPOS_MASK)) |(pulsePosition << HSADC_ADCCTL1_LITE__INTPULSEPOS_OFS);
}

/**
 * @brief sets clock prescaler value or clock divide ratio value
 * 
 * @param adc is the base address of the ADC module.
 * @param divideRatio is the valid clock prescaler value you want to set
 */
__STATIC_INLINE void DL_HSADC_setClockDivideRatio(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_CLOCK_DIVIDE divideRatio)
{
    adc->ADC_LITE_REGS.ADCCTL2_LITE_ = (adc->ADC_LITE_REGS.ADCCTL2_LITE_ & ~(HSADC_ADCCTL2_LITE__PRESCALE_MASK)) | divideRatio;
}
 
/**
 * @brief enable continue to interrupt mode. ADCINT pulse are generated whenever an EOC pulse is generated irrespective of whetehr the flag bit is cleared or not.
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used
 */
__STATIC_INLINE void DL_HSADC_enableContinueToInterruptMode(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCINTSEL_M33_ |= HSADC_ADCINTSEL_1_INT1CONT_MASK << (interrupt * (HSADC_ADCINTSEL_1_INT2CONT_OFS - HSADC_ADCINTSEL_1_INT1CONT_OFS));
}

/**
 * @brief disable continue to interrupt mode. no further ADCINT pulse are generated until the ADCINT flag in cleared by user with DL_HSADC_InterruptStatusClear().
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used
 */
__STATIC_INLINE void DL_HSADC_disableContinueToInterruptMode(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCINTSEL_M33_ &= ~(HSADC_ADCINTSEL_1_INT1CONT_MASK << (interrupt * (HSADC_ADCINTSEL_1_INT2CONT_OFS - HSADC_ADCINTSEL_1_INT1CONT_OFS)));
}

/**
 * @brief enables ADCINT Interrupt
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used
 */
__STATIC_INLINE void DL_HSADC_enableInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCINTSEL_M33_ |= HSADC_ADCINTSEL_1_INT1E_MASK << (interrupt * HSADC_ADCINTSEL_1_INT2SEL_OFS);
}

/**
 * @brief disable ADCINT Interrupt
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used 
 */
__STATIC_INLINE void DL_HSADC_disableInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCINTSEL_M33_ &= ~(HSADC_ADCINTSEL_1_INT1E_MASK << (interrupt * HSADC_ADCINTSEL_1_INT2SEL_OFS));
}

/**
 * @brief Returns if interrupt is enabled
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used
 * @return true: if interrupt is enabled , false: if interrupt is disabled 
 */
__STATIC_INLINE bool DL_HSADC_checkEnabledInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt)
{
    return (((adc->ADC_LITE_REGS.ADCINTSEL_M33_ >> (interrupt * HSADC_ADCINTSEL_1_INT2SEL_OFS)) & HSADC_ADCINTSEL_1_INT1E_MASK)  == HSADC_ADCINTSEL_1_INT1E_MASK);
}

/**
 * @brief selects which EOC to be selected as a source for the interrupt
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used 
 * @param eoc is the EOC number to be selected as a source for interrupt
 */
__STATIC_INLINE void DL_HSADC_InterruptSourceSelect(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt, DL_HSADC_SOCNumber eoc)
{
    adc->ADC_LITE_REGS.ADCINTSEL_M33_ = (adc->ADC_LITE_REGS.ADCINTSEL_M33_ & ~(HSADC_ADCINTSEL_1_INT1SEL_MASK << (interrupt * HSADC_ADCINTSEL_1_INT2SEL_OFS))) | (eoc << (interrupt * HSADC_ADCINTSEL_1_INT2SEL_OFS));
}

/**
 * @brief enable DMA continue to interrupt mode. ADCINT pulse are generated whenever an EOC pulse is generated irrespective of whetehr the flag bit is cleared or not.
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used
 */
__STATIC_INLINE void DL_HSADC_enableDMAContinueToInterruptMode(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_DMA_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCDMAINTSEL_M33_ |= HSADC_ADCDMAINTSEL_1_DMAINT1CONT_MASK << (interrupt * HSADC_ADCDMAINTSEL_1_DMAINT2SEL_OFS);
}

/**
 * @brief disable DMA continue to interrupt mode. no further ADCINT pulse are generated until the ADCINT flag in cleared by user with DL_HSADC_DMAInterruptStatusClear().
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used
 */
__STATIC_INLINE void DL_HSADC_disableDMAContinueToInterruptMode(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_DMA_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCDMAINTSEL_M33_ &= ~(HSADC_ADCDMAINTSEL_1_DMAINT1CONT_MASK << (interrupt * HSADC_ADCDMAINTSEL_1_DMAINT2SEL_OFS));
}

/**
 * @brief enables ADCINT DMA Interrupt
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used
 */
__STATIC_INLINE void DL_HSADC_enableDMAInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_DMA_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCDMAINTSEL_M33_ |= HSADC_ADCDMAINTSEL_1_DMAINT1E_MASK << (interrupt * HSADC_ADCDMAINTSEL_1_DMAINT2SEL_OFS);
}

/**
 * @brief disables ADCINT DMA Interrupt
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used
 */
__STATIC_INLINE void DL_HSADC_disableDMAInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_DMA_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCDMAINTSEL_M33_ &= ~(HSADC_ADCDMAINTSEL_1_DMAINT1E_MASK << (interrupt * HSADC_ADCDMAINTSEL_1_DMAINT2SEL_OFS));
}

/**
 * @brief selects which EOC to be selected as a source for the interrupt
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used 
 * @param eoc is the EOC number to be selected as a source for interrupt
 */
__STATIC_INLINE void DL_HSADC_DMAInterruptSourceSelect(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_DMA_InterruptNumber interrupt, DL_HSADC_SOCNumber eoc)
{
    adc->ADC_LITE_REGS.ADCDMAINTSEL_M33_ = (adc->ADC_LITE_REGS.ADCDMAINTSEL_M33_ & ~(HSADC_ADCDMAINTSEL_1_DMAINT1SEL_MASK << (interrupt * HSADC_ADCDMAINTSEL_1_DMAINT2SEL_OFS))) | (eoc << (interrupt * HSADC_ADCDMAINTSEL_1_DMAINT2SEL_OFS));
}

/**
 * @brief Returns any ADC Interrupt Flag Status. 
 * 
 * Reading these flags indicates if the associated INT condition occurred. This flag will be set irrespective of corresponding interrupt enable settings.
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used 
 * @return true: Selected EOC/OSINT event occured, false: Selected EOC/OSINT event did not occur
 */
__STATIC_INLINE bool DL_HSADC_getRawInterruptStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt)
{
    return (((adc->ADC_LITE_REGS.ADCRAWINTFLG_4INT >> interrupt) & HSADC_ADCRAWINTFLG_4INT_ADCRAWINT1_MASK) == HSADC_ADCRAWINTFLG_4INT_ADCRAWINT1_MASK);
}

 /**
 * @brief Returns any ADC DMA Interrupt Flag Status. 
 * 
 * Reading these flags indicates if the associated ADC DMA INT condition occurred. This flag will be set irrespective of corresponding DMA interrupt enable settings.
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used 
 * @return true: Selected EOC/OSINT event occured, false: Selected EOC/OSINT event did not occur
 */
__STATIC_INLINE bool DL_HSADC_getRawDMAInterruptStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_DMA_InterruptNumber interrupt)
{
    return (((adc->ADC_LITE_REGS.ADCRAWINTFLG_4INT >> interrupt) & HSADC_ADCRAWINTFLG_4INT_ADCDMARAWINT1_MASK) == HSADC_ADCRAWINTFLG_4INT_ADCDMARAWINT1_MASK);
}

/**
 * @brief Returns Interrupt Flag Status indicating if the associated ADCINT pulse was generated since the last clear or not.
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used 
 * @return true: ADCINT pulse generated, false: ADCINT pulse not generated
 */
__STATIC_INLINE bool DL_HSADC_getInterruptStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt)
{
    return (((adc->ADC_LITE_REGS.ADCINTFLG_4INT >> interrupt) & HSADC_ADCINTFLG_4INT_ADCINT1_MASK) == HSADC_ADCINTFLG_4INT_ADCINT1_MASK);
}

/**
 * @brief Returns Interrupt Result Ready Flag Status, which is set when the conversions results associated with ADCINT latch into the corresponding results register. This flag can be used in an ISR that is entered in early interrupt mode to ensure that the corresponding results are ready before proceeding to read the result register
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used 
 * @return true: Conversion results have latched, false: Conversion results have not latched 
 */
__STATIC_INLINE bool DL_HSADC_getInterruptResultReadyStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt)
{
    return (((adc->ADC_LITE_REGS.ADCINTFLG_4INT >> interrupt) & HSADC_ADCINTFLG_4INT_ADCINT1RESULT_MASK) == HSADC_ADCINTFLG_4INT_ADCINT1RESULT_MASK);
}

/**
 * @brief Returns ADC DMA Interrupt 3 Flag status. Reading these flags indicates if the associated ADCDMAINT pulse was generated since the last clear.
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used 
 * @return true: ADCDMAINT pulse generated, false: ADCDMAINT pulse not generated 
 */
__STATIC_INLINE bool DL_HSADC_getDMAInterruptStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_DMA_InterruptNumber interrupt)
{
    return (((adc->ADC_LITE_REGS.ADCINTFLG_4INT >> interrupt) & HSADC_ADCINTFLG_4INT_ADCDMAINT1_MASK) == HSADC_ADCINTFLG_4INT_ADCDMAINT1_MASK);
}

/**
 * @brief sets ADCINT flags status in the adc interrupt flag and adc raw interrupt flag registers
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used 
 */
__STATIC_INLINE void DL_HSADC_InterruptStatusForce(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCINTFLGFRC_4INT |= (HSADC_ADCINTFLGFRC_1_ADCINT1_MASK << interrupt);
}

/**
 * @brief sets ADCDMAINT flags status in the adc interrupt flag and adc raw interrupt flag registers
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used  
 */
__STATIC_INLINE void DL_HSADC_DMAInterruptStatusForce(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_DMA_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCINTFLGFRC_4INT |= (HSADC_ADCINTFLGFRC_1_ADCINT1_MASK << (interrupt + HSADC_ADCINTFLGFRC_1_ADCDMAINT1_OFS));
}

/**
 * @brief clears ADCINT flags status in the adc interrupt flag and adc raw interrupt flag registers. If software sets the clear bit on the same cycle that hardware is trying to set the flag it, then hardware has priority and the overflow bit will not be set.
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used 
 */
__STATIC_INLINE void DL_HSADC_InterruptStatusClear(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCINTFLGCLR_4INT |= (HSADC_ADCINTFLGCLR_1_ADCINT1_MASK << interrupt);
}

/**
 * @brief clears ADCDMAINT flags status in the adc interrupt flag and adc raw interrupt flag registers. If software sets the clear bit on the same cycle that hardware is trying to set the flag it, then hardware has priority and the overflow bit will not be set.
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used  
 */
__STATIC_INLINE void DL_HSADC_DMAInterruptStatusClear(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_DMA_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCINTFLGCLR_4INT |= (HSADC_ADCINTFLGCLR_1_ADCINT1_MASK << (interrupt + HSADC_ADCINTFLGCLR_1_ADCDMAINT1_OFS));
}

/**
 * @brief Returns Interrupt Overflow Status. flag is set, if an overflow occurred when generating ADCINT pulses. If the prespective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used  
 * @return true: if ADC interrupt overflow event detected ,
 * false: if No ADC interrupt overflow event detected 
 */
__STATIC_INLINE bool DL_HSADC_InterruptOverflowStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt)
{
    return (((adc->ADC_LITE_REGS.ADCINTOVF_4INT >> interrupt) & HSADC_ADCINTOVF_4INT_ADCINT1OVF_MASK) == HSADC_ADCINTOVF_4INT_ADCINT1OVF_MASK);
}

/**
 * @brief Returns DMA Interrupt Overflow Status. flag is set, if an overflow occurred when generating ADCINT pulses. If the prespective ADCINTFLG bit is set and a selected additional EOC trigger is generated, then an overflow condition occurs.
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used  
 * @return true: if ADC DMA interrupt overflow event detected ,
 * false: if No ADC DMA interrupt overflow event detected 
 */
__STATIC_INLINE bool DL_HSADC_DMAInterruptOverflowStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_DMA_InterruptNumber interrupt)
{
    return (((adc->ADC_LITE_REGS.ADCINTOVF_4INT >>interrupt) & HSADC_ADCINTOVF_4INT_ADCDMAINT1OVF_MASK) == HSADC_ADCINTOVF_4INT_ADCDMAINT1OVF_MASK);
}

/**
 * @brief clears the respective overflow bit in the adc interrupt overflow register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the register, then hardware has the priority and the register will be set.
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used  
 */
__STATIC_INLINE void DL_HSADC_InterruptOverflowStatusClear(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCINTOVFCLR_4INT |= (HSADC_ADCINTOVFCLR_4INT_ADCINT1OVF_MASK << interrupt);
}

/**
 * @brief clears the respective overflow bit in the adc interrupt overflow register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the register, then hardware has the priority and the register will be set.
 * 
 * @param adc is the base address of the ADC module.
 * @param interrupt is the interrupt number to be used  
 */
__STATIC_INLINE void DL_HSADC_DMAInterruptOverflowStatusClear(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_DMA_InterruptNumber interrupt)
{
    adc->ADC_LITE_REGS.ADCINTOVFCLR_4INT |= (HSADC_ADCINTOVFCLR_1_ADCINT1OVF_MASK << (interrupt + HSADC_ADCINTOVFCLR_1_ADCDMAINT1OVF_OFS));
}

/**
 * @brief Returns Start of Conversion Status. Flag is set, if Trigger has been received and sample is pending for SOC{#}. Flag will be automatically cleared when the SOC{#} conversion is started. {#} is the soc number.
 * 
 * @param adc is the base address of the ADC module.
 * @param soc is the SOC number
 * @return true: if No sample pending for SOC, false: if Trigger has been received and sample is pending for SOC 
 */
__STATIC_INLINE bool DL_HSADC_getStartOfConversationStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SOCNumber soc)
{
    return (((adc->ADC_LITE_REGS.ADCSOCFLG1_LITE >> soc) & HSADC_ADCSOCFLG1_LITE_SOC0_MASK) == HSADC_ADCSOCFLG1_LITE_SOC0_MASK);
}

/**
 * @brief Returns Start of Conversion Overflow Status. Flag is set, if an SOC{#} event was generated in hardware while an existing SOC{#} event was already penidng. {#} is the soc number.
 * 
 * @param adc is the base address of the ADC module.
 * @param soc is the SOC number
 * @return true: if No soc event overflow, false: if SOC event overflow
 */
__STATIC_INLINE bool DL_HSADC_getStartOfConversationOverflowStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SOCNumber soc)
{
    return (((adc->ADC_LITE_REGS.ADCSOCOVF1_M33_ >> soc) & HSADC_ADCSOCOVF1_M33__SOC0OVF_MASK) == HSADC_ADCSOCOVF1_M33__SOC0OVF_MASK);
}

/**
 * @brief clears the SOC{#} overflow flag in the SOC{#} overflow register. If software tries to set this bit on the same clock cycle that hardware tries to set the overflow bit in the register, then hardware has the priority and the register will be set.
 * 
 * @param adc is the base address of the ADC module.
 * @param soc is the SOC number
 */
__STATIC_INLINE void DL_HSADC_clearStartOfConversationOverflowStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SOCNumber soc)
{
    adc->ADC_LITE_REGS.ADCSOCOVF1_LITE_CLR |= HSADC_ADCSOCOVF1_LITE_CLR_SOC0OVF_MASK << soc;
}

/**
 * @brief Selects the channel to be converted when SOC{#} event is recieved by the ADC. {#} is the soc number.
 * 
 * @param adc is the base address of the ADC module.
 * @param soc is the SOC number
 * @param adcin is the channel number
 */
__STATIC_INLINE void DL_HSADC_SOCChannelSelect(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SOCNumber soc, DL_HSADC_ADCIN adcin )
{
    uint32_t *ctlRegAddr;
    ctlRegAddr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCSOC0CTL_M33_ + soc * ADCSOCxCTL_M33_STEP);
    *ctlRegAddr = (*ctlRegAddr & ~HSADC_ADCSOC0CTL_M33__CHSEL_MASK) | (adcin << HSADC_ADCSOC0CTL_M33__CHSEL_OFS);
}

/**
 * @brief Enables SOC{#} thrashold comparator. {#} is the soc number
 * 
 * @param adc is the base address of the ADC module.
 * @param soc is the SOC number
 */
__STATIC_INLINE void DL_HSADC_enableSOCComparator(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SOCNumber soc)
{
    uint32_t *ctlRegAddr;
    ctlRegAddr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCSOC0CTL_M33_ + soc * ADCSOCxCTL_M33_STEP);
    *ctlRegAddr |= HSADC_ADCSOC0CTL_M33__COMPEN_MASK;
}

/**
 * @brief Disables SOC{#} thrashold comparator. {#} is the soc number
 * 
 * @param adc is the base address of the ADC module.
 * @param soc is the SOC number
 */
__STATIC_INLINE void DL_HSADC_disableSOCComparator(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SOCNumber soc)
{
    uint32_t *ctlRegAddr;
    ctlRegAddr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCSOC0CTL_M33_ + soc * ADCSOCxCTL_M33_STEP);
    *ctlRegAddr &= ~HSADC_ADCSOC0CTL_M33__COMPEN_MASK;
}

/**
 * @brief Returns PPB TRIP high status.Flag is set, if the digital compare trip high event has occurred  in PPB{#}. {#} is the ppb number
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 * @return true: if trip high event occurred, false: if trip high event not occurred 
 */
__STATIC_INLINE bool DL_HSADC_getPPBTripHighStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    return (((adc->ADC_LITE_REGS.ADCEVTSTAT_4PPB_ >> ppbNumber * HSADC_ADCEVTSTAT_4PPB__PPB2TRIPHI_OFS) & HSADC_ADCEVTSTAT_4PPB__PPB1TRIPHI_MASK) == HSADC_ADCEVTSTAT_4PPB__PPB1TRIPHI_MASK);
}

/**
 * @brief Returns PPB TRIP low status. Flag is set, if the digital compare trip low event has occurred  in PPB{#}. {#} is the ppb number
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 * @return true: if trip low event occurred, false: if trip low event not occurred 
 */
__STATIC_INLINE bool DL_HSADC_getPPBTripLowStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    return (((adc->ADC_LITE_REGS.ADCEVTSTAT_4PPB_ >> ppbNumber * HSADC_ADCEVTSTAT_4PPB__PPB2TRIPHI_OFS) & HSADC_ADCEVTSTAT_4PPB__PPB1TRIPLO_MASK) == HSADC_ADCEVTSTAT_4PPB__PPB1TRIPLO_MASK);
}

/**
 * @brief Returns PPB TRIP zero status. Flag is set, if the digital compare trip zero event has occurred  in PPB{#}. {#} is the ppb number
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 * @return true: if trip zero event occurred, false: if trip zero event not occurred 
 */
__STATIC_INLINE bool DL_HSADC_getPPBTripZeroStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    return (((adc->ADC_LITE_REGS.ADCEVTSTAT_4PPB_ >> ppbNumber * HSADC_ADCEVTSTAT_4PPB__PPB2TRIPHI_OFS) & HSADC_ADCEVTSTAT_4PPB__PPB1ZERO_MASK) == HSADC_ADCEVTSTAT_4PPB__PPB1ZERO_MASK);
}

