TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_hsadc.h
/**
 * @brief Returns PPB TRIP limit status. Flag is set, if the digital compare trip limit event has occurred in PPB{#}. {#} is the ppb number
 * 
 * @param adc is the base address of the ADC module. 
 * @param ppbNumber is the PPB number 
 * @return true: if trip limit event occurred, false: if trip limit event not occurred 
 */
__STATIC_INLINE bool DL_HSADC_getPPBTripInLimitStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    return (((adc->ADC_LITE_REGS.ADCEVTSTAT_4PPB_ >> ppbNumber * HSADC_ADCEVTSTAT_4PPB__PPB2TRIPHI_OFS) & HSADC_ADCEVTSTAT_4PPB__PPB1INLIMIT_MASK) == HSADC_ADCEVTSTAT_4PPB__PPB1INLIMIT_MASK);
}

/**
 * @ brief Clears the corresponding trip high flag in the ADCEVTSTAT register.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_clearPPBTripHighStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTCLR_4PPB_ |= (uint32_t)(HSADC_ADCEVTCLR_4PPB__PPB1TRIPHI_MASK<<(ppbNumber * (HSADC_ADCEVTCLR_4PPB__PPB2TRIPHI_OFS- HSADC_ADCEVTCLR_4PPB__PPB1TRIPHI_OFS)));
}

/**
 * @brief Clears the corresponding trip low flag in the ADCEVTSTAT register.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_clearPPBTripLowStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTCLR_4PPB_ |= (uint32_t)(HSADC_ADCEVTCLR_4PPB__PPB1TRIPLO_MASK<<(ppbNumber * (HSADC_ADCEVTCLR_4PPB__PPB2TRIPLO_OFS- HSADC_ADCEVTCLR_4PPB__PPB1TRIPLO_OFS)));
}

/**
 * @brief Clears the corresponding trip zero flag in the ADCEVTSTAT register.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_clearPPBTripZeroStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTCLR_4PPB_ |= (uint32_t)(HSADC_ADCEVTCLR_4PPB__PPB1ZERO_MASK<<(ppbNumber * (HSADC_ADCEVTCLR_4PPB__PPB2ZERO_OFS- HSADC_ADCEVTCLR_4PPB__PPB1ZERO_OFS)));
}

/**
 * @brief Clears the corresponding trip limit flag in the ADCEVTSTAT register.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_clearPPBTripInLimitStatus(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTCLR_4PPB_ |= (uint32_t)(HSADC_ADCEVTCLR_4PPB__PPB1INLIMIT_MASK<<(ppbNumber * (HSADC_ADCEVTCLR_4PPB__PPB2INLIMIT_OFS- HSADC_ADCEVTCLR_4PPB__PPB1INLIMIT_OFS)));
}

/**
 * @brief  Allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_enablePPBTripHighEvent(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTSEL_4PPB_ |= (uint32_t)(HSADC_ADCEVTSEL_4PPB__PPB1TRIPHI_MASK<<(ppbNumber * (HSADC_ADCEVTSEL_4PPB__PPB2TRIPHI_OFS- HSADC_ADCEVTSEL_4PPB__PPB1TRIPHI_OFS)));
}

/**
 * @brief Allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_enablePPBTripLowEvent(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTSEL_4PPB_ |= (uint32_t)(HSADC_ADCEVTSEL_4PPB__PPB1TRIPLO_MASK<<(ppbNumber * (HSADC_ADCEVTSEL_4PPB__PPB2TRIPLO_OFS- HSADC_ADCEVTSEL_4PPB__PPB1TRIPLO_OFS)));
}

/**
 * @brief Allows the corresponding rising trip zero flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_enablePPBTripZeroEvent(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTSEL_4PPB_ |= (uint32_t)(HSADC_ADCEVTSEL_4PPB__PPB1ZERO_MASK<<(ppbNumber * (HSADC_ADCEVTSEL_4PPB__PPB2ZERO_OFS- HSADC_ADCEVTSEL_4PPB__PPB1ZERO_OFS)));
}

/**
 * @brief Allows the corresponding rising trip limit flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_enablePPBTripInLimitEvent(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTSEL_4PPB_ |= (uint32_t)(HSADC_ADCEVTSEL_4PPB__PPB1INLIMIT_MASK<<(ppbNumber * (HSADC_ADCEVTSEL_4PPB__PPB2INLIMIT_OFS- HSADC_ADCEVTSEL_4PPB__PPB1INLIMIT_OFS)));
}

/**
 * @brief Clears the trip high event. After this, it can produce additional events to the PWM blocks.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_disablePPBTripHighEvent(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTSEL_4PPB_ &= ~(uint32_t)(HSADC_ADCEVTSEL_4PPB__PPB1TRIPHI_MASK<<(ppbNumber * (HSADC_ADCEVTSEL_4PPB__PPB2TRIPHI_OFS- HSADC_ADCEVTSEL_4PPB__PPB1TRIPHI_OFS)));
}

/**
 * @brief  Clears the trip low event. After this, it can produce additional events to the PWM blocks.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_disablePPBTripLowEvent(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTSEL_4PPB_ &= ~(uint32_t)(HSADC_ADCEVTSEL_4PPB__PPB1TRIPLO_MASK<<(ppbNumber * (HSADC_ADCEVTSEL_4PPB__PPB2TRIPLO_OFS- HSADC_ADCEVTSEL_4PPB__PPB1TRIPLO_OFS)));
}

/**
 * @brief Clears the trip zero event. After this, it can produce additional events to the PWM blocks.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_disablePPBTripZeroEvent(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTSEL_4PPB_ &= ~(uint32_t)(HSADC_ADCEVTSEL_4PPB__PPB1ZERO_MASK<<(ppbNumber * (HSADC_ADCEVTSEL_4PPB__PPB2ZERO_OFS- HSADC_ADCEVTSEL_4PPB__PPB1ZERO_OFS)));
}

/**
 * @brief Clears the trip limit event. After this, it can produce additional events to the PWM blocks.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_disablePPBTripInLimitEvent(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTSEL_4PPB_ &= ~(uint32_t)(HSADC_ADCEVTSEL_4PPB__PPB1INLIMIT_MASK<<(ppbNumber * (HSADC_ADCEVTSEL_4PPB__PPB2INLIMIT_OFS- HSADC_ADCEVTSEL_4PPB__PPB1INLIMIT_OFS)));
}

/**
 * @brief Allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_enablePPBTripHighInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTINTSEL_4PPB_ |= (uint32_t)(HSADC_ADCEVTINTSEL_4PPB__PPB1TRIPHI_MASK<<(ppbNumber * (HSADC_ADCEVTINTSEL_4PPB__PPB2TRIPHI_OFS- HSADC_ADCEVTINTSEL_4PPB__PPB1TRIPHI_OFS)));
}

/**
 * @brief Allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_enablePPBTripLowInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTINTSEL_4PPB_ |= (uint32_t)(HSADC_ADCEVTINTSEL_4PPB__PPB1TRIPLO_MASK<<(ppbNumber * (HSADC_ADCEVTINTSEL_4PPB__PPB2TRIPLO_OFS- HSADC_ADCEVTINTSEL_4PPB__PPB1TRIPLO_OFS)));
}

/**
 * @brief Allows the corresponding rising trip zero flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_enablePPBTripZeroInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTINTSEL_4PPB_ |= (uint32_t)(HSADC_ADCEVTINTSEL_4PPB__PPB1ZERO_MASK<<(ppbNumber * (HSADC_ADCEVTINTSEL_4PPB__PPB2ZERO_OFS- HSADC_ADCEVTINTSEL_4PPB__PPB1ZERO_OFS)));
}

/**
 * @brief Allows the corresponding rising trip limit flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_enablePPBTripInLimitInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTINTSEL_4PPB_ |= (uint32_t)(HSADC_ADCEVTINTSEL_4PPB__PPB1INLIMIT_MASK<<(ppbNumber * (HSADC_ADCEVTINTSEL_4PPB__PPB2INLIMIT_OFS- HSADC_ADCEVTINTSEL_4PPB__PPB1INLIMIT_OFS)));
}

/**
 * @brief Clears the trip high event. After this, it can produce additional interrupts to the PIE.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_disablePPBTripHighInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTINTSEL_4PPB_ &= ~(uint32_t)(HSADC_ADCEVTINTSEL_4PPB__PPB1TRIPHI_MASK<<(ppbNumber * (HSADC_ADCEVTINTSEL_4PPB__PPB2TRIPHI_OFS- HSADC_ADCEVTINTSEL_4PPB__PPB1TRIPHI_OFS)));
}

/**
 * @brief Clears the trip low event. After this, it can produce additional interrupts to the PIE.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_disablePPBTripLowInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTINTSEL_4PPB_ &= ~(uint32_t)(HSADC_ADCEVTINTSEL_4PPB__PPB1TRIPLO_MASK<<(ppbNumber * (HSADC_ADCEVTINTSEL_4PPB__PPB2TRIPLO_OFS- HSADC_ADCEVTINTSEL_4PPB__PPB1TRIPLO_OFS)));
}

/**
 * @brief Clears the trip zero event. After this, it can produce additional interrupts to the PIE.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_disablePPBTripZeroInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTINTSEL_4PPB_ &= ~(uint32_t)(HSADC_ADCEVTINTSEL_4PPB__PPB1ZERO_MASK<<(ppbNumber * (HSADC_ADCEVTINTSEL_4PPB__PPB2ZERO_OFS- HSADC_ADCEVTINTSEL_4PPB__PPB1ZERO_OFS)));
}

/**
 * @brief Clears the trip limit event. After this, it can produce additional interrupts to the PIE.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number 
 */
__STATIC_INLINE void DL_HSADC_disablePPBTripInLimitInterrupt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    adc->ADC_LITE_REGS.ADCEVTINTSEL_4PPB_ &= ~(uint32_t)(HSADC_ADCEVTINTSEL_4PPB__PPB1INLIMIT_MASK<<(ppbNumber * (HSADC_ADCEVTINTSEL_4PPB__PPB2INLIMIT_OFS- HSADC_ADCEVTINTSEL_4PPB__PPB1INLIMIT_OFS)));
}

/**
 * @brief returns ADC Type. Always set to 6 for HSADC-12b.
 * 
 * @param adc is the base address of the ADC module.
 * @return ADC Type number (8 bit value)
 */
__STATIC_INLINE uint32_t DL_HSADC_getADCType(hsadc_ADC_LITE_REGS_Regs *adc)
{
    return (adc->ADC_LITE_REGS.ADCREV_HSADC12B_ & HSADC_ADCREV_HSADC12B__TYPE_MASK);
}

/**
 * @brief returns ADC Revision. To allow documentation of differences between revisions. First version is labeled as 00h.
 * 
 * @param adc is the base address of the ADC module.
 * @return ADC Revision number (24 bit value) 
 */
__STATIC_INLINE uint32_t DL_HSADC_getADCRevision(hsadc_ADC_LITE_REGS_Regs *adc)
{
    return (uint32_t) (((adc->ADC_LITE_REGS.ADCREV_HSADC12B_ & HSADC_ADCREV_HSADC12B__REV_MASK) >> HSADC_ADCREV_HSADC12B__REV_OFS));
}

/**
 * @brief sets ADC Offset Trim
 * 
 * @param adc is the base address of the ADC module.
 * @param offsetTrim is the offset trim
 */
__STATIC_INLINE void DL_HSADC_setOffsetTrim(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_OffsetTrim offsetTrim)
{
    adc->ADC_LITE_REGS.ADCOFFTRIM_LITE_ = (adc->ADC_LITE_REGS.ADCOFFTRIM_LITE_ & ~(HSADC_ADCOFFTRIM_LITE__OFFTRIM_MASK)) | offsetTrim;
}

/**
 * @brief enables the post conversion hardware processing circuit to automatically clear the ADCEVTSTAT on a conversion if the event condition is no longer present.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_enablePPBCycleByCycle(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    uint32_t* PPBConfigAddr;
    PPBConfigAddr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCPPB1CONFIG_M33_ + ppbNumber * ADCPPBxCONFIG_M33_STEP);
    *PPBConfigAddr |= HSADC_ADCPPB1CONFIG_M33__CBCEN_MASK;
}

/**
 * @brief  enables the post conversion hardware processing circuit that performs a two's complement on the output of the offset/reference subtraction unit before storing the result in the  ADCPPB{#}RESULT register. {#} is the ppb number.
 * 
 * ADCPPB{#}RESULT = ADCPPB{#}OFFREF - ADCRESULTx
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_enablePPBTwosCompliment(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    uint32_t* PPBConfigAddr;
    PPBConfigAddr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCPPB1CONFIG_M33_ + ppbNumber * ADCPPBxCONFIG_M33_STEP);
    *PPBConfigAddr |= HSADC_ADCPPB1CONFIG_M33__TWOSCOMPEN_MASK;
}

/**
 * @brief disables the post conversion hardware processing circuit to automatically clear the ADCEVTSTAT on a conversion if the event condition is no longer present.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_disablePPBCycleByCycle(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    uint32_t* PPBConfigAddr;
    PPBConfigAddr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCPPB1CONFIG_M33_ + ppbNumber * ADCPPBxCONFIG_M33_STEP);
    *PPBConfigAddr &= ~HSADC_ADCPPB1CONFIG_M33__CBCEN_MASK;
}

/**
 * @brief disables two's compliment conversion before storing the result in the  ADCPPB{#}RESULT register. {#} is the ppb number.
 * 
 * ADCPPB{#}RESULT = ADCRESULTx - ADCPPB{#}OFFREF
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_disablePPBTwosCompliment(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    uint32_t* PPBConfigAddr;
    PPBConfigAddr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCPPB1CONFIG_M33_ + ppbNumber * ADCPPBxCONFIG_M33_STEP);
    *PPBConfigAddr &= ~HSADC_ADCPPB1CONFIG_M33__TWOSCOMPEN_MASK;
}

/**
 * @brief sets the digital comparator trip high limit. When comparing to an ADCPPBxRESULT register, the upper bits will be ignored:
 * TRIPHI[15:13] will be ignored in 12 bit mode
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 * @param highLimit is the high limit
 */
__STATIC_INLINE void DL_HSADC_setPPBTripHighLimit(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber, uint16_t highLimit)
{
    uint32_t* PPBConfigAddr;
    PPBConfigAddr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCPPB1TRIPHI_LITE_ + ppbNumber * ADCPPBxCONFIG_M33_STEP);
    *PPBConfigAddr = (*PPBConfigAddr & ~(HSADC_ADCPPB1TRIPHI_LITE__LIMITHI_MASK)) | highLimit;
}

/**
 * @brief sets the digital comparator trip low limit if ADCPPB{#}TRIPLO.LIMITLO2EN = 1. When comparing to an ADCPPBxRESULT register, the upper bits will be ignored:
 * TRIPLO[15:13] will be ignored in 12 bit mode
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 * @param lowLimit is the low limit
 */
__STATIC_INLINE void DL_HSADC_setPPBTripLowLimit(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber, uint16_t lowLimit)
{
    uint32_t* PPBConfigAddr;
    PPBConfigAddr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCPPB1TRIPLO_LITE_ + ppbNumber * ADCPPBxCONFIG_M33_STEP);
    *PPBConfigAddr = (*PPBConfigAddr & ~(HSADC_ADCPPB1TRIPLO_LITE__LIMITLO_MASK)) | lowLimit;
}

/**
 * @brief Defines the delay from the fall edge of ADCSOC in terms of system clock cycles, for the interrupt to be generated.
 * 
 * @param adc is the base address of the ADC module.
 * @param delayNumCycles is the delay in terms of system clock cycles
 */
__STATIC_INLINE void DL_HSADC_setEarlyInterruptGenerationDelay(hsadc_ADC_LITE_REGS_Regs *adc, uint8_t delayNumCycles)
{
    ASSERT(delayNumCycles <= maxDelayNumCycles);
    adc->ADC_LITE_REGS.ADCINTCYCLE_LITE_ = (adc->ADC_LITE_REGS.ADCINTCYCLE_LITE_ & ~(HSADC_ADCINTCYCLE_LITE__DELAY_MASK)) | delayNumCycles;
}

/**
 * @brief returns the ADC wrapper type. Always set to 6 for this ADC
 * 
 * @param adc is the base address of the ADC module.
 * @return ADC Wrapper Type (8 bit value) 
 */
__STATIC_INLINE uint32_t DL_HSADC_getADCWrapperType(hsadc_ADC_LITE_REGS_Regs *adc)
{
    return (adc->ADC_LITE_REGS.ADCREV2_LITE_ & HSADC_ADCREV2_LITE__WRAPPERTYPE_MASK);
}

/**
 * @brief returns the ADC wrapper revision. To allow documentation of differences between revisions. First version is labeled as 00h.
 * 
 * @param adc is the base address of the ADC module.
 * @return ADC Wrapper Revision version (24 bit value) 
 */
__STATIC_INLINE uint32_t DL_HSADC_getADCWrapperRevision(hsadc_ADC_LITE_REGS_Regs *adc)
{
    return ((adc->ADC_LITE_REGS.ADCREV2_LITE_  & HSADC_ADCREV2_LITE__WRAPPERREV_MASK)>> HSADC_ADCREV2_LITE__WRAPPERREV_OFS);
}

/**
 * @brief sets the oversampling limit
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number 
 * @param limit is the oversampling limit
 */
__STATIC_INLINE void DL_HSADC_setPPBOversamplingLimit(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber, DL_HSADC_OversamplingLimit limit)
{
    uint32_t* PPBLimitAddr;
    PPBLimitAddr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCPPB1LIMIT_LITE_ + ppbNumber * ADCPPBxLIMIT_LITE_STEP);
    *PPBLimitAddr = (*PPBLimitAddr & ~(HSADC_ADCPPB1LIMIT_LITE__LIMIT_MASK)) | limit;
}

/**
 * @brief Oversampling Partial Count.  Each time a new result propagates through the PPB signal chain and accumulates into ADCPPB{#}PSUM this register is incremented by 1.  
 * This register is reset when either a count-match event occurs (PCOUNT = LIMIT) or PPB{#} receives a sync. event.
 * This result is available 1 SYSCLK cycle after the associated ADCPPB{#}RESULT is available. 
 * This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB{#}RESULT timing information). 
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 * @return Oversampling Partial Count (3 bit value)  
 */
__STATIC_INLINE uint32_t DL_HSADC_readPPBPartialCount(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    uint32_t* PPBPcountAddr;
    PPBPcountAddr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCPPB1PCOUNT_LITE_ + ppbNumber * ADCPPBxPCOUNT_LITE_STEP);
    return (*PPBPcountAddr & HSADC_ADCPPB1PCOUNT_LITE__PCOUNT_MASK);
}

/**
 * @brief sets the number of bits to right shift PSUM before loading into the final SUM.  
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 * @param shift is the number of bits to shift
 */
__STATIC_INLINE void DL_HSADC_setPPBRightShift(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber, DL_HSADC_PPBRightShift shift )
{
    uint32_t* PPBConfig2Addr;
    PPBConfig2Addr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCPPB1CONFIG2_M33_ + ppbNumber * ADCPPBxCONFIG2_M33_STEP);
    *PPBConfig2Addr = (*PPBConfig2Addr & ~(HSADC_ADCPPB1CONFIG2_M33__SHIFT_MASK)) | shift;
}

/**
 * @brief select ADCPPB{#}SUM as Post Processing Block {#} Compare Source Select.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_selectCompareSourceAsPPBSum(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    uint32_t* PPBConfig2Addr;
    PPBConfig2Addr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCPPB1CONFIG2_M33_ + ppbNumber * ADCPPBxCONFIG2_M33_STEP);
    *PPBConfig2Addr |= HSADC_ADCPPB1CONFIG2_M33__COMPSEL_MASK;
}

/**
 * @brief select ADCPPB{#}RESULT as Post Processing Block {#} Compare Source Select.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 */
__STATIC_INLINE void DL_HSADC_selectCompareSourceAsPPBResult(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber ppbNumber)
{
    uint32_t* PPBConfig2Addr;
    PPBConfig2Addr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCPPB1CONFIG2_M33_ + ppbNumber * ADCPPBxCONFIG2_M33_STEP);
    *PPBConfig2Addr &= ~HSADC_ADCPPB1CONFIG2_M33__COMPSEL_MASK;
}

/**
 * @brief returns Post Processing Block {#} Oversampling Partial Sum.  
 * Each time a new result propagates through the PPB signal chain and latches into ADCPPB{#}RESULT the result is subsequently accumulated into this register.  
 * This register is reset when either a count-match event occurs (PCOUNT = LIMIT) or PPB{#} receives a sync. event.
 * 
 * @param adc is the base address of the ADC module.
 * @param ppbNumber is the PPB number
 * @return Oversampling Partial Sum (16 bit value)  
 */
__STATIC_INLINE uint32_t DL_HSADC_getOversamplingPartialSum(hsadc_ADC_LITE_REGS_Regs *adc,  DL_HSADC_SEQNumber ppbNumber)
{
    uint32_t* PPBPsumAddr;
    PPBPsumAddr = (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCPPB1PSUM_LITE_ + ppbNumber * ADCPPBxCONFIG2_M33_STEP);
    return (*PPBPsumAddr & HSADC_ADCPPB1PSUM_LITE__PSUM_MASK);
}

/**
 * @brief sets END SOC of last enabled sequence
 * 
 * @param adc is the base address of the ADC module.
 * @param seqEndSOC is the end of SOC sequence number
 */
__STATIC_INLINE void DL_HSADC_setEndOfSequencer(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SOCNumber seqEndSOC)
{
    
    adc->ADC_LITE_REGS.ADCSEQCTL = (adc->ADC_LITE_REGS.ADCSEQCTL & ~(HSADC_ADCSEQCTL_SEQEND_MASK)) | seqEndSOC;
}

/**
 * @brief sets SOC sequencer preempt
 * 0X: Pre-empt disabled 
 * 10: Pre-empt enabled and will not restart aborted Sequence
 * 11: Pre-empt enabled and will restart aborted Sequence
 * 
 * @param adc is the base address of the ADC module.
 * @param seqPreemptNumber is the seq preempt number
 */
__STATIC_INLINE void DL_HSADC_setSequencerPreempt(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_seqPreempt seqPreemptNumber)
{
    adc->ADC_LITE_REGS.ADCSEQCTL = (adc->ADC_LITE_REGS.ADCSEQCTL & ~(HSADC_ADCSEQCTL_SEQPREEMPT_MASK)) | (seqPreemptNumber << HSADC_ADCSEQCTL_SEQPREEMPT_OFS);
}

