TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_hsadc.h
/**
 * @brief sets up the sequencer configurations. 
 * SOC{#} Acquisition Prescale. Controls the sample and hold window for each SOC in this Seqeunce. 
 * The configured acquisition time must be at least as long as one ADCCLK cycle for correct ADC operation and atmost 1473 ADCCLK cycles.
 * SOC{#} Trigger Source Select. Along with the SOC{#} field in the ADCINTSOCSEL1 register, this bit field configures which trigger will set the SOC{#} flag in the ADCSOCFLG1 register to initiate a conversion to start once priority is given to it.
 * 
 * @param adc is the base address of the ADC module.
 * @param seqNumber is the sequencer number
 * @param sampleWindow is the sample window.
 * @param trigger is the trigger
 * @param socStartNumber is the Beginning SOC of this sequencer 
 */
__STATIC_INLINE void DL_HSADC_setupSequencer(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber seqNumber, uint32_t sampleWindow,  DL_HSADC_Trigger trigger, DL_HSADC_SOCNumber socStartNumber)
{
    ASSERT(sampleWindow >= minSampleWindow && sampleWindow <= maxSampleWindow);
    uint32_t ACQPS;
    uint32_t mask;
    uint32_t* seqConfigAddr;
    seqConfigAddr =  (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCSEQ1CONFIG + seqNumber * ADCSEQxCONFIG_STEP);
    mask = (HSADC_ADCSEQ1CONFIG_ACQPS_MASK | HSADC_ADCSEQ1CONFIG_SEQSTART_MASK | HSADC_ADCSEQ1CONFIG_TRIGSEL_MASK);
    
    if (sampleWindow > 448UL){
        ACQPS = (3<<6UL) | (((sampleWindow - 448UL) >> 4UL) - 1UL);
    }
    else if (sampleWindow > 192UL){
        ACQPS = (2<<6UL) | (((sampleWindow - 192UL) >> 2UL) - 1UL);
    }
    else if (sampleWindow > 64UL){
        ACQPS = (1<<6UL) | (((sampleWindow - 64UL) >> 1UL) - 1UL);
    }
    else{
        ACQPS = sampleWindow - 1UL;
    }
    *seqConfigAddr = (*seqConfigAddr & ~(mask) ) | ACQPS| socStartNumber << HSADC_ADCSEQ1CONFIG_SEQSTART_OFS | trigger << HSADC_ADCSEQ1CONFIG_TRIGSEL_OFS;
}

/**
 * @brief enables the sequencer
 * 
 * @param adc is the base address of the ADC module.
 * @param seqNumber is the sequencer number
 */
__STATIC_INLINE void DL_HSADC_enableSequencer(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber seqNumber)
{
    uint32_t* seqConfigAddr;
    seqConfigAddr =  (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCSEQ1CONFIG + seqNumber * ADCSEQxCONFIG_STEP);
    *seqConfigAddr |= HSADC_ADCSEQ1CONFIG_SEQENABLE_MASK;
}

/**
 * @brief disables the sequencer
 * 
 * @param adc is the base address of the ADC module.
 * @param seqNumber is the sequencer number
 */
__STATIC_INLINE void DL_HSADC_disableSequencer(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber seqNumber)
{
    uint32_t* seqConfigAddr;
    seqConfigAddr =  (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCSEQ1CONFIG + seqNumber * ADCSEQxCONFIG_STEP);
    *seqConfigAddr &= ~HSADC_ADCSEQ1CONFIG_SEQENABLE_MASK;
}

/**
 * @brief enables sample cap reset and sets the sample cap reset. Resets sample cap after conversion to either vrefhi/2 or vreflo
 * sampleCapResetSelect_vreflo – The sample cap is reset to Vreflo after each conversion
 * sampleCapResetSelect_half_vrefhi – The sample cap is reset to Vrefhi/2 after each conversion
 * 
 * @param adc is the base address of the ADC module.
 * @param seqNumber is the sequencer number
 * @param sampleCapResetSelect is used to select sample cap reset to either vrefhi/2 or vreflo
 */
__STATIC_INLINE void DL_HSADC_setSampleCapReset(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber seqNumber, DL_HSADC_sampleCapResetSelect sampleCapResetSelect)
{
    uint32_t* seqConfigAddr;
    seqConfigAddr =  (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCSEQ1CONFIG + seqNumber * ADCSEQxCONFIG_STEP);
    *seqConfigAddr = (*seqConfigAddr & ~(HSADC_ADCSEQ1CONFIG_SAMPCAPRESETDISABLE_MASK | HSADC_ADCSEQ1CONFIG_SAMPCAPRESETSEL_MASK)) | ((uint32_t)sampleCapResetSelect << HSADC_ADCSEQ1CONFIG_SAMPCAPRESETSEL_OFS);
}

/**
 * @brief Disables the sample cap reset. The sample cap is not reset after each conversion.
 * 
 * @param adc is the base address of the ADC module.
 * @param seqNumber is the sequencer number
 */
__STATIC_INLINE void DL_HSADC_disableSampleCapReset(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber seqNumber)
{
    uint32_t* seqConfigAddr;
    seqConfigAddr =  (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCSEQ1CONFIG + seqNumber * ADCSEQxCONFIG_STEP);
    *seqConfigAddr |= HSADC_ADCSEQ1CONFIG_SAMPCAPRESETDISABLE_MASK; 
}

/**
 * @brief enables the sequencer software force
 * 
 * @param adc is the base address of the ADC module.
 * @param seqNumber is the sequencer number
 */
__STATIC_INLINE void DL_HSADC_triggerSequencerSoftwareForce(hsadc_ADC_LITE_REGS_Regs *adc, DL_HSADC_SEQNumber seqNumber)
{
    uint32_t* seqConfigAddr;
    seqConfigAddr =  (uint32_t*)((uint8_t*)&adc->ADC_LITE_REGS.ADCSEQ1CONFIG + seqNumber * ADCSEQxCONFIG_STEP);
    *seqConfigAddr |= HSADC_ADCSEQ1CONFIG_SEQSWFRC_MASK; 
}

/**
 * @brief returns the 12-bit ADC result. 
 * After the ADC completes a conversion of SOC{#}, the digital result is placed in this bit field.
 * If oversampling is enabled, Final SUM (After any Shift if enabled) will be stored in this register after completing the specified number of samples.
 * 
 * @param adcResult is the base address of the ADC result module
 * @param resultNumber is the SOC number of the result
 * @return ADC result (16 bit value)  
 */
__STATIC_INLINE uint32_t DL_HSADC_getResult(hsadc_ADC_LITE_RESULT_REGS_Regs *adcResult, DL_HSADC_SOCNumber resultNumber)
{
    uint32_t* resultAddr;
    resultAddr =  (uint32_t*)((uint8_t*)&adcResult->ADC_LITE_RESULT_REGS.ADCRESULT0_12B_M33 + resultNumber * ADCRESULTx_12B_M33_STEP);
    return (*resultAddr & HSADC_ADCRESULT0_12B_M33_RESULT_MASK);
}

/**
 * @brief returs the PPB result. The result of the offset/reference subtraction post conversion processing is returned by this API.
 * This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  
 * In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results (in order from lowest numbered PPB to highest) will each become available every 2-3 SYSCLK cycles (refer to the TRM for more detailed timing information). 
 * 
 * @param adcResult is the base address of the ADC result module
 * @param ppbNumber is the PPB number
 * @return the PPB result (13 bit value)
 */
__STATIC_INLINE uint32_t DL_HSADC_getPPBResult(hsadc_ADC_LITE_RESULT_REGS_Regs *adcResult, DL_HSADC_SEQNumber ppbNumber)
{
    uint32_t* ppbResultAddr;
    ppbResultAddr =  (uint32_t*)((uint8_t*)&adcResult->ADC_LITE_RESULT_REGS.ADCPPB1RESULT_12B_ + ppbNumber * ADCPPBxRESULT_12B_STEP);
    return (*ppbResultAddr & HSADC_ADCPPB1RESULT_12B__PPBRESULT_MASK);
}

/**
 * @brief returns the final oversampling sum result. 
 * When either a count-match event occurs (PCOUNT = LIMIT) or PPB{#} receives a sync. event, the value of PSUM is loaded into this register.  
 * In the case of a count-match event, the sum loaded into this register includes the value from the most recent conversion. 
 * The value from PSUM will be right shifted by the amount specified in the SHIFT register before being loaded into the final SUM result register.
 * This result is available 1 SYSCLK cycle after the associated ADCPPB{#}RESULT is available (only in case of a count-match event).
 * This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC (refer to the ADCPPB{#}RESULT timing information).
 * 
 * @param adcResult is the base address of the ADC result module
 * @param ppbNumber is the PPB number
 * @return the final oversampling sum result (16 bit value)
 */
__STATIC_INLINE uint32_t DL_HSADC_getFinalSumResult(hsadc_ADC_LITE_RESULT_REGS_Regs *adcResult, DL_HSADC_SEQNumber ppbNumber)
{
    uint32_t* ppbSumAddr;
    ppbSumAddr =  (uint32_t*)((uint8_t*)&adcResult->ADC_LITE_RESULT_REGS.ADCPPB1SUM_LITE_ + ppbNumber * ADCPPBxSUM_LITE_STEP);
    return (*ppbSumAddr & HSADC_ADCPPB1SUM_LITE__SUM_MASK);
}

/**
 * @brief returns oversampling Final Count. 
 * When either a count-match event occurs (PCOUNT = LIMIT) or PPB{#} receives a sync. event, the value of PCOUNT is loaded into this register.
 * 
 * @param adcResult is the base address of the ADC result module
 * @param ppbNumber is the PPB number
 * @return oversampling Final Count 
 */
__STATIC_INLINE uint32_t DL_HSADC_getFinalCountResult(hsadc_ADC_LITE_RESULT_REGS_Regs *adcResult, DL_HSADC_SEQNumber ppbNumber)
{
    uint32_t* ppbCountAddr;
    ppbCountAddr =  (uint32_t*)((uint8_t*)&adcResult->ADC_LITE_RESULT_REGS.ADCPPB1COUNT_LITE_ + ppbNumber * ADCPPBxCOUNT_LITE_STEP);
    return (*ppbCountAddr & HSADC_ADCPPB1COUNT_LITE__COUNT_MASK);
}

/**
 * @brief returns 32-bit FIFO result containing a pair of conversion results. 
 * This API can be used to read the conversion result of all SOCs associated with the sequencer in a sequential manner through FIFO mode. 
 * Since the Result registers are maximum 16-bits wide, every read will return RESULT corresponding to 2 consecutive SOCs
 * LSB 16-bits [15:0] will contain odd results {1,3,5,7...}, and MSB 16-bits [31:16] will contain even results {2,4,6,8...}. 
 * If Odd number of SOCs are associated with a sequencer, final read will have 16’h0 in the MSB 16-bits [31:16].
 * Example: if SEQ1 – Start: SOC0, End: SOC2
 * First read will return SOC0’s result in LSB 16-bits [15:0] and soc1’s result in MSB 16-bits [31:16]
 * Second read will return SOC2’s result in LSB 16-bits [15:0] and 16'h0 in MSB 16-bits [31:16].
 * 
 * @param adcResult is the base address of the ADC result module 
 * @param seqNumber is the sequencer number
 * @return FIFO result consisting of 2 consequtive conversion results (32 bit value)
 */
__STATIC_INLINE uint32_t DL_HSADC_getSeqFIFOResult32(hsadc_ADC_LITE_RESULT_REGS_Regs *adcResult, DL_HSADC_SEQNumber seqNumber)
{
    uint32_t* seqFIFOresult;
    seqFIFOresult =  (uint32_t*)((uint8_t*)&adcResult->ADC_LITE_RESULT_REGS.ADCSEQ1FIFORESULT + seqNumber * ADCSEQxFIFORESULT_STEP);
    return (*seqFIFOresult & HSADC_ADCSEQ1FIFORESULT_SEQFIFORESULT_MASK);

