TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/dl_hsadc.h
}

/**
 * @brief passes by refference, pair of conversion results from the FIFO for a given sequencer. odd results will be in LSB 16-bits [15:0], even results will be in MSB 16-bits [31:16]
 * This API can be used to read the conversion result of all SOCs associated with the sequencer in a sequential manner through FIFO mode. 
 * Since the Result registers are maximum 16-bits wide, every read will return RESULT corresponding to 2 consecutive SOCs
 * resultFirst will contain odd results {1,3,5,7...}, and resultSecond will contain even results {2,4,6,8...}. 
 * 
 * @param adcResult is the base address of the ADC result module
 * @param seqNumber is the sequencer number
 * @param resultFirst returns odd results {1,3,5,7...}
 * @param resultSecond returns even results {2,4,6,8...}
 */
__STATIC_INLINE void DL_HSADC_getSeqFIFOResultByReference(hsadc_ADC_LITE_RESULT_REGS_Regs *adcResult, DL_HSADC_SEQNumber seqNumber, uint16_t *resultFirst, uint16_t *resultSecond)
{
    uint32_t* seqFIFOresult;
    seqFIFOresult =  (uint32_t*)((uint8_t*)&adcResult->ADC_LITE_RESULT_REGS.ADCSEQ1FIFORESULT + seqNumber * ADCSEQxFIFORESULT_STEP);
    *resultFirst = (uint16_t)((*seqFIFOresult & HSADC_ADCSEQ1FIFORESULT_SEQFIFORESULT_MASK) & 0xFFFF);
    *resultSecond = (uint16_t)((*seqFIFOresult & HSADC_ADCSEQ1FIFORESULT_SEQFIFORESULT_MASK) >> 16);
}

/**
 * @brief Returns the status of FIFO conversions for a given sequencer. This API can be used to check if Conversion from all the SOCs associated with the Sequencer{#} are complete and result is available to be read. {#} is the sequencer number
 * 
 * @param adcResult is the base address of the ADC result module
 * @param seqNumber is the sequencer number
 * @return true: Conversion from all the SOCs associated with the Sequencer are complete and result is available to be read, false: All Conversions associated with the current Sequencer are NOT complete.
 */
__STATIC_INLINE bool DL_HSADC_isSeqFIFOValid(hsadc_ADC_LITE_RESULT_REGS_Regs *adcResult, DL_HSADC_SEQNumber seqNumber)
{
    uint32_t* seqFIFOStatus;
    seqFIFOStatus =  (uint32_t*)((uint8_t*)&adcResult->ADC_LITE_RESULT_REGS.ADCSEQ1FIFOSTATUS + seqNumber * ADCSEQxFIFOSTATUS_STEP);
    return ((*seqFIFOStatus & HSADC_ADCSEQ1FIFOSTATUS_SEQFIFOVALID_MASK) == HSADC_ADCSEQ1FIFOSTATUS_SEQFIFOVALID_MASK);
}

/**
 * @brief returns the number of pending reads with DL_HSADC_getSeqFIFOResult32 or DL_HSADC_getSeqFIFOResultByReference
 * Note: 
 * This field is only updated when after the last byte of ADCSEQ{#}FIFORESULT is read.
 * The Pending read information will not be updated for debug reads. 
 * Once all the data in the FIFO has been read, FIFO will wrap back. Subsequent reads will read from the beginning of the FIFO.
 * Returns half of total SOCs in SEQ{#} for even number of SOCs and Returns half of (1 + total SOCs) in SEQ{#}
 * 
 * @param adcResult 
 * @param seqNumber 
 * @return number of pending reads (4 bit value)
 */
__STATIC_INLINE uint32_t DL_HSADC_getPendingReads(hsadc_ADC_LITE_RESULT_REGS_Regs *adcResult, DL_HSADC_SEQNumber seqNumber)
{
    uint32_t* seqFIFOStatus;
    seqFIFOStatus =  (uint32_t*)((uint8_t*)&adcResult->ADC_LITE_RESULT_REGS.ADCSEQ1FIFOSTATUS + seqNumber * ADCSEQxFIFOSTATUS_STEP);
    return ((*seqFIFOStatus & HSADC_ADCSEQ1FIFOSTATUS_SEQFIFOPENDREAD_MASK) >> HSADC_ADCSEQ1FIFOSTATUS_SEQFIFOPENDREAD_OFS);
}


#ifdef __cplusplus
}
#endif

#endif /* __MSP_HAS_ADC__ */

#endif /* ti_dl_DL_HSADC__include */
/** @}*/